turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/Atmel.SAM4L_DFP.pdsc
      <condition id="ATSAM4LC4A">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC4A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC4C">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC4C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC4B">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC4B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS2C">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS2C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC8C">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC8C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS2A">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS2A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS8B">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS8B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS4A">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS4A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS8A">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS8A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS4C">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS4C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS4B">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS4B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC2C">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC2C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC2B">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC2B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC2A">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC2A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC8B">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC8B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LC8A">
         <require Dvendor="Atmel:3" Dname="ATSAM4LC8A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS8C">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS8C"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAM4LS2B">
         <require Dvendor="Atmel:3" Dname="ATSAM4LS2B"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LC4A">
         <description>Headers and startup code for Atmel ATSAM4LC4A</description>
         <files>
            <file condition="C" category="include" name="sam4l4/include"/>
            <file condition="C" category="header" name="sam4l4/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l4/gcc/gcc/sam4lc4a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l4/gcc/gcc/sam4lc4a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l4/iar/iar/sam4lc4a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l4/iar/iar/sam4lc4a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LC4C">
         <description>Headers and startup code for Atmel ATSAM4LC4C</description>
         <files>
            <file condition="C" category="include" name="sam4l4/include"/>
            <file condition="C" category="header" name="sam4l4/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l4/gcc/gcc/sam4lc4c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l4/gcc/gcc/sam4lc4c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l4/iar/iar/sam4lc4c_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l4/iar/iar/sam4lc4c_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LC4B">
         <description>Headers and startup code for Atmel ATSAM4LC4B</description>
         <files>
            <file condition="C" category="include" name="sam4l4/include"/>
            <file condition="C" category="header" name="sam4l4/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l4/gcc/gcc/sam4lc4b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l4/gcc/gcc/sam4lc4b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l4/iar/iar/sam4lc4b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l4/iar/iar/sam4lc4b_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LS2C">
         <description>Headers and startup code for Atmel ATSAM4LS2C</description>
         <files>
            <file condition="C" category="include" name="sam4l4/include"/>
            <file condition="C" category="header" name="sam4l4/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l4/gcc/gcc/sam4ls2c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l4/gcc/gcc/sam4ls2c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l4/iar/iar/sam4ls2c_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l4/iar/iar/sam4ls2c_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LC8C">
         <description>Headers and startup code for Atmel ATSAM4LC8C</description>
         <files>
            <file condition="C" category="include" name="sam4l8/include"/>
            <file condition="C" category="header" name="sam4l8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l8/gcc/gcc/sam4lc8c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l8/gcc/gcc/sam4lc8c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l8/iar/iar/sam4lc8c_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l8/iar/iar/sam4lc8c_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LS2A">
         <description>Headers and startup code for Atmel ATSAM4LS2A</description>
         <files>
            <file condition="C" category="include" name="sam4l4/include"/>
            <file condition="C" category="header" name="sam4l4/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l4/gcc/gcc/sam4ls2a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l4/gcc/gcc/sam4ls2a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l4/iar/iar/sam4ls2a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l4/iar/iar/sam4ls2a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LS8B">
         <description>Headers and startup code for Atmel ATSAM4LS8B</description>
         <files>
            <file condition="C" category="include" name="sam4l8/include"/>
            <file condition="C" category="header" name="sam4l8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l8/gcc/gcc/sam4ls8b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l8/gcc/gcc/sam4ls8b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l8/iar/iar/sam4ls8b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l8/iar/iar/sam4ls8b_sram.icf"
                  attr="config"/>
         </files>
      </component>
