turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/Atmel.SAM4L_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LC8A">
         <description>Headers and startup code for Atmel ATSAM4LC8A</description>
         <files>
            <file condition="C" category="include" name="sam4l8/include"/>
            <file condition="C" category="header" name="sam4l8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l8/gcc/gcc/sam4lc8a_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l8/gcc/gcc/sam4lc8a_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l8/iar/iar/sam4lc8a_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l8/iar/iar/sam4lc8a_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LS8C">
         <description>Headers and startup code for Atmel ATSAM4LS8C</description>
         <files>
            <file condition="C" category="include" name="sam4l8/include"/>
            <file condition="C" category="header" name="sam4l8/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l8/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l8/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l8/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l8/gcc/gcc/sam4ls8c_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l8/gcc/gcc/sam4ls8c_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l8/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l8/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l8/iar/iar/sam4ls8c_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l8/iar/iar/sam4ls8c_sram.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.1.0"
                 condition="ATSAM4LS2B">
         <description>Headers and startup code for Atmel ATSAM4LS2B</description>
         <files>
            <file condition="C" category="include" name="sam4l4/include"/>
            <file condition="C" category="header" name="sam4l4/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="sam4l4/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="sam4l4/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/system_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="sam4l4/gcc/gcc/startup_sam4l.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="sam4l4/gcc/gcc/sam4ls2b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="sam4l4/gcc/gcc/sam4ls2b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/ARM/startup_sam4l.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="sam4l4/armcc/Device/Source/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/system_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="sam4l4/iar/iar/startup_sam4l.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="sam4l4/iar/iar/sam4ls2b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="sam4l4/iar/iar/sam4ls2b_sram.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
